artillery/rctf.yml
config:
  target: "http://localhost:8000"
  processor: "./util.js"
  http:
    pool: 100
    timeout: 30
  phases:
    - duration: 10
      arrivalRate: 250
scenarios:
  - name: "Register and delete"
    flow:
      - function: "generateRandomData"
      - get:
          url: "/"
      - get:
          url: "/static/bundle.86d41.js"
      - get:
          url: "/register"
      - post:
          url: "/api/auth/register"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            division: 0
          capture:
            json: "$.data.authToken"
            as: "token"
      - get:
          url: "/api/challs"
          headers:
            Authorization: "Bearer {{ token }}"
      - post:
          url: "/api/challs/{{ pid }}/submit"
          json:
            flag: "flag{test_flag_here}"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 5
      - get:
          url: "/api/users/me"
          headers:
            Authorization: "Bearer {{ token }}"